package lists;

public class standartWords {
    public static final String GREETINGS = ("**************************************************************************************" +
            "\n**************************************************************************************" +
            "\n****** ВАС ПРИВЕТСВУЕТ ПРОГРАММА ДЛЯ ШИФРОВАНИЯ/ДЕШИФРОВКИ ТЕКСТА ШИФРОМ ЦЕЗАРЯ ******" +
            "\n**************************************************************************************" +
            "\n**************************************************************************************" +
            "\nВведите соответствующую цифру с клавиатуры для выбор функции:" +
            "\n1. Кодирование текста;" +
            "\n2. Дешифрование текста с помощью известного ключа;" +
            "\n3. Дешифрование текста методом bruteforce;" +
            "\n4. Дешифрование текста методом лингвистического анализа." +
            "\nДля выхода из программы введите \"exit\".\n");
    public static final String boobs = "⠄⠄⠄⠄⠄⠄⠄⢀⠤⣒⠍⣢⢗⡞⣿⣂⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄" +
            "\n⠄⠄⠄⠄⠄⢀⣴⠪⢕⢫⢚⣴⡏⣼⢋⣶⣮⠳⡆⠄⠄⠄⠄⠄⠄⠄" +
            "\n⠄⠄⠄⠄⢠⡿⣵⢱⡇⢣⢟⣿⢜⣳⡿⠿⣿⡇⠿⠄⠄⠄⠄⠄⠄⠄" +
            "\n⠄⠄⠄⠄⠸⣼⢣⢏⡴⠋⣺⣴⣷⠞⠛⢿⣿⠐⠂⠄⠄⠄⠄⠄⠄⠄" +
            "\n⠄⠄⠄⠄⢸⢸⠄⡕⢄⢾⣿⣿⣿⣿⣿⣿⣛⣁⡇⠄⠄⠄⠄⠄⠄⠄" +
            "\n⠄⠄⠄⠄⠈⣇⠃⡉⠉⠅⣿⣿⣿⣿⣿⣟⣍⣀⡃⠄⠄⠄⠄⠄⠄⠄" +
            "\n⠄⠄⠄⠄⠄⣟⠷⡅⢸⣿⣬⣛⡻⠿⣿⣿⣿⡿⠃⠄⠄⠄⠄⠄⠄⠄" +
            "\n⠄⠄⠄⠄⠄⢱⡭⠞⢻⣿⣿⣿⣿⣿⣿⠆⢰⡞⢝⡂⠄⠄⠄⠄⠄⠄" +
            "\n⠄⢀⣀⣤⣤⣶⢴⢃⣿⣿⣿⣿⡏⣿⠟⡄⣌⢷⣖⢭⣀⠄⠄⠄⠄⠄" +
            "\n⣿⣿⣿⣿⣿⣿⠃⣸⣿⣿⣿⡏⢸⢣⣾⣿⡹⣾⠋⣷⠹⡀⠙⡄⠄⠄" +
            "\n⣿⣿⣿⣿⣿⡟⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⠙⡣⣿⣆⣗⠄⣿⡄⠄" +
            "\n⢸⣿⣿⣿⠿⡴⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⢳⣌⢿⡘⢗⠻⢇⠄" +
            "\n⢸⣧⢩⣕⡔⡄⣿⣿⣿⣿⣷⠻⢫⣼⣿⣿⣿⣧⠘⡮⠓⣷⠠⡱⣤⠙" +
            "\n⠈⢣⡟⡌⠄⢳⢻⣿⣿⣿⣿⡇⣿⣿⣿⣿⣿⢏⠦⣧⢣⡟⡀⢸⡉⠉" +
            "\n⠿⠸⢹⣤⠄⠄⠓⡝⢿⣿⣿⠇⣿⣿⣿⠟⡥⠊⣤⠄⠞⣼⣇⠤⠓⠄" +
            "\n⣫⡄⢆⢀⠄⠄⠄⠈⠢⡙⢫⣾⡜⢫⠕⠋⠄⠄⠄⢀⣾⣿⡇⠄⠄⠄" +
            "\n⣿⣿⠈⠣⣗⡀⡄⢆⢀⣨⣞⣥⣊⣀⣀⣀⣤⠴⠚⣿⣿⣿⡇⠄⠄⠄" +
            "\n⣿⣿⠄⠄⠄⠉⠉⠉⠉⠄⠄⠄⠄⠄⠄⠄⠄⠄⢠⣿⣿⣿⡇⠄⠄⠄";
    public static final String FIRST_FILE_PATH_encr = "Введите путь к файлу c текстом для шифрования: \n";
    public static final String SECOND_FILE_PATH_encr = "Введите путь к файлу для записи зашифрованного текста: \n";
    public static final String FIRST_FILE_PATH_decr = "Введите путь к файлу c зашифрованным текстом: \n";
    public static final String SECOND_FILE_PATH_decr = "Введите путь к файлу для записи дешифрованного текста: \n";
    public static final String KEY = "Введите ключ для шифрования: \n";
}
